FIO-tests-07-05-08-01-2021-AAAAA/Configs/Test-results/fio-results
read-4k-0: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
read-4k-1: (g=1): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.16
Starting 2 processes
{
  "fio version" : "fio-3.16",
  "timestamp" : 1610089610,
  "timestamp_ms" : 1610089610068,
  "time" : "Fri Jan  8 07:06:50 2021",
  "global options" : {
    "ioengine" : "libaio",
    "size" : "1G",
    "direct" : "1",
    "runtime" : "30",
    "time_based" : "1",
    "filename" : "/data/fio.test.file"
  },
  "jobs" : [
    {
      "jobname" : "read-4k-0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "1",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 795394048,
        "io_kbytes" : 776752,
        "bw_bytes" : 26512251,
        "bw" : 25890,
        "iops" : 6472.717576,
        "runtime" : 30001,
        "total_ios" : 194188,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 38119,
          "max" : 14428272,
          "mean" : 100616.047243,
          "stddev" : 131784.702060
        },
        "clat_ns" : {
          "min" : 2062,
          "max" : 11341492,
          "mean" : 51840.518992,
          "stddev" : 126064.200978,
          "percentile" : {
            "1.000000" : 2160,
            "5.000000" : 2192,
            "10.000000" : 2192,
            "20.000000" : 2224,
            "30.000000" : 2256,
            "40.000000" : 2288,
            "50.000000" : 2320,
            "60.000000" : 2384,
            "70.000000" : 118272,
            "80.000000" : 121344,
            "90.000000" : 168960,
            "95.000000" : 171008,
            "99.000000" : 207872,
            "99.500000" : 220160,
            "99.900000" : 317440,
            "99.950000" : 1384448,
            "99.990000" : 6455296
          }
        },
        "lat_ns" : {
          "min" : 120503,
          "max" : 14434055,
          "mean" : 152915.347375,
          "stddev" : 165279.487327
        },
        "bw_min" : 13031,
        "bw_max" : 25990,
        "bw_agg" : 80.283271,
        "bw_mean" : 20785.338983,
        "bw_dev" : 1449.908589,
        "bw_samples" : 59,
        "iops_min" : 3257,
        "iops_max" : 6497,
        "iops_mean" : 5196.050847,
        "iops_stddev" : 362.503956,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 4.226667,
      "sys_cpu" : 67.670000,
      "ctx" : 66867,
      "majf" : 0,
      "minf" : 13,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 66.361464,
        "10" : 0.158609,
        "20" : 0.069520,
        "50" : 0.023173,
        "100" : 0.030898,
        "250" : 33.090613,
        "500" : 0.192082,
        "750" : 0.010000,
        "1000" : 0.010814
      },
      "latency_ms" : {
        "2" : 0.021114,
        "4" : 0.016479,
        "10" : 0.013904,
        "20" : 0.010000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "read-4k-1",
      "groupid" : 1,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "8",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 1926860800,
        "io_kbytes" : 1881700,
        "bw_bytes" : 64226552,
        "bw" : 62721,
        "iops" : 15680.310656,
        "runtime" : 30001,
        "total_ios" : 470425,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 4366,
          "max" : 20307985,
          "mean" : 47183.136270,
          "stddev" : 111645.985956
        },
        "clat_ns" : {
          "min" : 87569,
          "max" : 21331649,
          "mean" : 461552.856751,
          "stddev" : 405407.249354,
          "percentile" : {
            "1.000000" : 90624,
            "5.000000" : 91648,
            "10.000000" : 193536,
            "20.000000" : 207872,
            "30.000000" : 313344,
            "40.000000" : 337920,
            "50.000000" : 448512,
            "60.000000" : 544768,
            "70.000000" : 577536,
            "80.000000" : 593920,
            "90.000000" : 700416,
            "95.000000" : 864256,
            "99.000000" : 1122304,
            "99.500000" : 1368064,
            "99.900000" : 5799936,
            "99.950000" : 10158080,
            "99.990000" : 11337728
          }
        },
        "lat_ns" : {
          "min" : 158309,
          "max" : 21336384,
          "mean" : 509103.177620,
          "stddev" : 407227.413889
        },
        "bw_min" : 39872,
        "bw_max" : 67440,
        "bw_agg" : 100.000000,
        "bw_mean" : 62792.932203,
        "bw_dev" : 5943.168260,
        "bw_samples" : 59,
        "iops_min" : 9968,
        "iops_max" : 16860,
        "iops_mean" : 15698.186441,
        "iops_stddev" : 1485.774481,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 6.623333,
      "sys_cpu" : 73.796667,
      "ctx" : 45201,
      "majf" : 0,
      "minf" : 20,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 99.998512,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999787,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 8.034012,
        "250" : 17.084551,
        "500" : 31.799968,
        "750" : 35.442207,
        "1000" : 5.197640
      },
      "latency_ms" : {
        "2" : 2.059414,
        "4" : 0.208960,
        "10" : 0.122442,
        "20" : 0.049317,
        "50" : 0.010000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "vda",
      "read_ios" : 662059,
      "write_ios" : 1,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 100648,
      "write_ticks" : 1,
      "in_queue" : 1220,
      "util" : 99.408304
    }
  ]
}

read-4k-0: (groupid=0, jobs=1): err= 0: pid=296: Fri Jan  8 07:06:50 2021
  read: IOPS=6472, BW=25.3MiB/s (26.5MB/s)(759MiB/30001msec)
    slat (usec): min=38, max=14428, avg=100.62, stdev=131.78
    clat (usec): min=2, max=11341, avg=51.84, stdev=126.06
     lat (usec): min=120, max=14434, avg=152.92, stdev=165.28
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[  119], 80.00th=[  122], 90.00th=[  169], 95.00th=[  172],
     | 99.00th=[  208], 99.50th=[  221], 99.90th=[  318], 99.95th=[ 1385],
     | 99.99th=[ 6456]
   bw (  KiB/s): min=13031, max=25990, per=80.28%, avg=20785.34, stdev=1449.91, samples=59
   iops        : min= 3257, max= 6497, avg=5196.05, stdev=362.50, samples=59
  lat (usec)   : 4=66.36%, 10=0.16%, 20=0.07%, 50=0.02%, 100=0.03%
  lat (usec)   : 250=33.09%, 500=0.19%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.01%, 20=0.01%
  cpu          : usr=4.23%, sys=67.67%, ctx=66867, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=194188,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
read-4k-1: (groupid=1, jobs=1): err= 0: pid=298: Fri Jan  8 07:06:50 2021
  read: IOPS=15.7k, BW=61.3MiB/s (64.2MB/s)(1838MiB/30001msec)
    slat (usec): min=4, max=20307, avg=47.18, stdev=111.65
    clat (usec): min=87, max=21331, avg=461.55, stdev=405.41
     lat (usec): min=158, max=21336, avg=509.10, stdev=407.23
    clat percentiles (usec):
     |  1.00th=[   91],  5.00th=[   92], 10.00th=[  194], 20.00th=[  208],
     | 30.00th=[  314], 40.00th=[  338], 50.00th=[  449], 60.00th=[  545],
     | 70.00th=[  578], 80.00th=[  594], 90.00th=[  701], 95.00th=[  865],
     | 99.00th=[ 1123], 99.50th=[ 1369], 99.90th=[ 5800], 99.95th=[10159],
     | 99.99th=[11338]
   bw (  KiB/s): min=39872, max=67440, per=100.00%, avg=62792.93, stdev=5943.17, samples=59
   iops        : min= 9968, max=16860, avg=15698.19, stdev=1485.77, samples=59
  lat (usec)   : 100=8.03%, 250=17.08%, 500=31.80%, 750=35.44%, 1000=5.20%
  lat (msec)   : 2=2.06%, 4=0.21%, 10=0.12%, 20=0.05%, 50=0.01%
  cpu          : usr=6.62%, sys=73.80%, ctx=45201, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=470425,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=25.3MiB/s (26.5MB/s), 25.3MiB/s-25.3MiB/s (26.5MB/s-26.5MB/s), io=759MiB (795MB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=61.3MiB/s (64.2MB/s), 61.3MiB/s-61.3MiB/s (64.2MB/s-64.2MB/s), io=1838MiB (1927MB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=662059/1, merge=0/0, ticks=100648/1, in_queue=1220, util=99.41%